# GeometryCreationUtilities Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryCreationUtilities Class
Members See Also
---
A utility that allows construction of basic solid shapes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class GeometryCreationUtilities
```

Visual Basic
---
```text
Public NotInheritable Class GeometryCreationUtilities
```

Visual C++
---
```text
public ref class GeometryCreationUtilities abstract sealed
```

# Remarks
The shapes created by these utilities are not a part of any Revit document, but can be used in conjunction with other geometric utilities from within API applications.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GeometryCreationUtilities
# See Also
GeometryCreationUtilities Members
Autodesk.Revit.DB Namespace